mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*	header info, to be added
 *
 *
 *
 */


/*******************************************************************************
 *                              INCLUDE FILES
 ******************************************************************************/
#include <stddef.h>
#include <string.h>

#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "cfg_nrf_drv_spi.h"
#include "cfg_nrf51_muha_pinout.h"
#include "bsp_ecg_ADS1192.h"

/*******************************************************************************
 *                              DEFINES
 ******************************************************************************/
//! SPI constants
#define BSP_ECG_ADS1192_SPI_OPCODE_SIZE_R       (2u)    //!< SPI Read command byte size
#define BSP_ECG_ADS1192_SPI_OPCODE_SIZE_W       (3u)    //!< SPI Write command byte size
#define BSP_ECG_ADS1192_SPI_READ_OP             (0x20u) //!< SPI read command
#define BSP_ECG_ADS1192_SPI_WRITE_OP            (0x40u) //!< SPI write command
#define BSP_ECG_ADS1192_SPI_MSG_MAX_SIZE        (14u)   //!< Maximum SPI message size
#define BSP_ECG_ADS1192_SPI_SINGLE_REG          (0x00u) //!< Single register read operation
#define BSP_ECG_ADS1192_SPI_READ_OFFSET         (1u)    //!< SPI read RX offset
#define BSP_ECG_ADS1192_SPI_REG_VALUE_INDEX     (2u)    //!< SPI register value index

//! Time constants
#define BSP_ECG_ADS1192_WAIT_TIME_8_US          (8u)    //!< 8 us wait time
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_4_TCLK   (8u)    //!< 4 tCLK time period (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_18_TCLK  (36u)   //!< 18 tCLK time period (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_1_FMOD   (8u)    //!< 1 fMOD wait time (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_9_FMOD   (72u)   //!< 9 fMOD wait time (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_32_US    (32u)   //!< Internal oscillator wait time (us)
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_1_MS     (1000u) //!< 1ms wait time
#define BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS   (200000u) //!< 200ms wait time

//! ECG ADS1192 SPI commands
#define BSP_ECG_ADS1192_SPI_WAKEUP              (0x02u) //!< Wake-up from standby mode
#define BSP_ECG_ADS1192_SPI_STANDBY             (0x04u) //!< Enter standby mode
#define BSP_ECG_ADS1192_SPI_RESET               (0x06u) //!< Reset the device
#define BSP_ECG_ADS1192_SPI_START               (0x08u) //!< Start conversions
#define BSP_ECG_ADS1192_SPI_STOP                (0x0Au) //!< Stop conversion
#define BSP_ECG_ADS1192_SPI_OFFSETCAL           (0x1Au) //!< Channel offset calibration
#define BSP_ECG_ADS1192_SPI_RDATAC              (0x10u) //!< Read Data Continuous mode
#define BSP_ECG_ADS1192_SPI_SDATAC              (0x11u) //!< Stop Read Data Continuous
#define BSP_ECG_ADS1192_SPI_RDATA               (0x12u) //!< Read data by command

//! ECG ADS1192 bit masks
#define BSP_ECG_ADS1192_RLD_OFF_MASK            (0x10u) //!< Right-Leg drive off detection

//! ECG ADS1192 temperature constants
#define BSP_ECG_ADS1192_TEMP_CONST_1            (168) //!< Temperature constant 1
#define BSP_ECG_ADS1192_TEMP_CONST_2            (394) //!< Temperature constant 2
#define BSP_ECG_ADS1192_TEMP_CONST_3            (25)  //!< Temperature constant 3
#define BSP_ECG_ADS1192_TEMP_BIT_MASK           (8u)  //!< Temperature bit mask

//! ECG ADS1192 register addresses
#define BSP_ECG_ADS1192_REG_ADDR_ID             (0x0u)  //!< ID Control register
// global settings across channels
#define BSP_ECG_ADS1192_REG_ADDR_CONFIG_1       (0x1u)  //!< Configuration register 1
#define BSP_ECG_ADS1192_REG_ADDR_CONFIG_2       (0x2u)  //!< Configuration register 2
#define BSP_ECG_ADS1192_REG_ADDR_LOFF           (0x3u)  //!< Lead-off Control register
// channel specific settings
#define BSP_ECG_ADS1192_REG_ADDR_CH1_SET        (0x4u)  //!< Channel 1 settings
#define BSP_ECG_ADS1192_REG_ADDR_CH2_SET        (0x5u)  //!< Channel 2 settings
#define BSP_ECG_ADS1192_REG_ADDR_RLD_SENS       (0x6u)  //!< RLD Sense selection
#define BSP_ECG_ADS1192_REG_ADDR_LOFF_SENS      (0x7u)  //!< Lead-off Sense selection
#define BSP_ECG_ADS1192_REG_ADDR_LOFF_STAT      (0x8u)  //!< Lead-off Status
// GPIO and other settings
#define BSP_ECG_ADS1192_REG_ADDR_MISC_1         (0x9u)  //!< Miscellaneous Control register 1
#define BSP_ECG_ADS1192_REG_ADDR_MISC_2         (0xAu)  //!< Miscellaneous Control register 2
#define BSP_ECG_ADS1192_REG_ADDR_GPIO           (0xBu)  //!< General-Purpose IO register

/*******************************************************************************
 *                          GLOBAL VARIABLES
 ******************************************************************************/
static const uint8_t ecgADS1192RegAddr[BSP_ECG_ADS1192_reg_COUNT] = {
        BSP_ECG_ADS1192_REG_ADDR_ID,
        BSP_ECG_ADS1192_REG_ADDR_CONFIG_1,
        BSP_ECG_ADS1192_REG_ADDR_CONFIG_2,
        BSP_ECG_ADS1192_REG_ADDR_LOFF,
        BSP_ECG_ADS1192_REG_ADDR_CH1_SET,
        BSP_ECG_ADS1192_REG_ADDR_CH2_SET,
        BSP_ECG_ADS1192_REG_ADDR_RLD_SENS,
        BSP_ECG_ADS1192_REG_ADDR_LOFF_SENS,
        BSP_ECG_ADS1192_REG_ADDR_LOFF_STAT,
        BSP_ECG_ADS1192_REG_ADDR_MISC_1,
        BSP_ECG_ADS1192_REG_ADDR_MISC_2,
        BSP_ECG_ADS1192_REG_ADDR_GPIO
};

/*******************************************************************************
 *                          PRIVATE FUNCTION DECLARATIONS
 ******************************************************************************/
static void BSP_ECG_ADS1192_sendSpiCommand(BSP_ECG_ADS1192_device_S *inDevice,
                                           const uint8_t inSpiCmd,
                                           BSP_ECG_ADS1192_err_E *outErr);
static void BSP_ECG_ADS1192_writeSingleReg(BSP_ECG_ADS1192_device_S *inDevice,
                                           const BSP_ECG_ADS1192_reg_E inStartReg,
                                           const uint8_t *inData,
                                           BSP_ECG_ADS1192_err_E *outErr);
static uint8_t BSP_ECG_ADS1192_readSingleReg(BSP_ECG_ADS1192_device_S *inDevice,
                                             const BSP_ECG_ADS1192_reg_E inStartReg,
                                             uint8_t *outData,
                                             BSP_ECG_ADS1192_err_E *outErr);
static void BSP_ECG_ADS1192_readData(BSP_ECG_ADS1192_device_S *inDevice,
                                    const uint8_t inSize,
                                    uint8_t *outData,
                                    BSP_ECG_ADS1192_err_E *outErr);
static void BSP_ECG_ADS1192_initReset(BSP_ECG_ADS1192_device_S *inDevice,
                                      BSP_ECG_ADS1192_err_E *outErr);
static void BSP_ECG_ADS1192_updateTemperature(BSP_ECG_ADS1192_device_S *inDevice,
                                              BSP_ECG_ADS1192_err_E *outErr);
static void BSP_ECG_ADS1192_readTestSignal(BSP_ECG_ADS1192_device_S *inDevice,
                                           BSP_ECG_ADS1192_err_E *outErr);
static void BSP_ECG_ADS1192_detectRldOff(BSP_ECG_ADS1192_device_S *inDevice,
                                         BSP_ECG_ADS1192_err_E *outErr);
static void BSP_ECG_ADS1192_measureRldSignal(BSP_ECG_ADS1192_device_S *inDevice,
                                             BSP_ECG_ADS1192_err_E *outErr);
/*******************************************************************************
 *                          PUBLIC FUNCTION DEFINITIONS
 ******************************************************************************/
/*******************************************************************************
 * @brief Function initializes ECG ADS1192 component.
 ******************************************************************************
 * @param [in]  *inDevice - device structure for ECG driver
 * @param [in]  *inConfig - configuration structure for ECG driver.
 * @param [out] *outErr   - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
void BSP_ECG_ADS1192_init(BSP_ECG_ADS1192_device_S *inDevice,
                          BSP_ECG_ADS1192_config_S *inConfig,
                          BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    if((inDevice != NULL) && (inConfig != NULL)) {
        inDevice->config = inConfig;
        inDevice->isInitialized = false;

        // internal oscillator start-up time
        nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_32_US);

