mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
/*******************************************************************************
 * @brief Function for writing to one register of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inReg        - register address.
 * @param [in]  *inData      - pointer to data to be sent.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_writeSingleReg(BSP_ECG_ADS1192_device_S *inDevice,
                                           const BSP_ECG_ADS1192_reg_E inReg,
                                           const uint8_t *inData,
                                           BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t opcode[BSP_ECG_ADS1192_SPI_OPCODE_SIZE_W] = { 0u };
    uint8_t regAddr = ecgADS1192RegAddr[inReg];
    uint8_t rxBufferLen = 0u;
    uint8_t txBufferLen = BSP_ECG_ADS1192_SPI_OPCODE_SIZE_W;
    uint32_t ret_code;

    if((inDevice != NULL) && (inData != NULL)) {
        /* byte format for Read opcode: | 001R RRRR | 000N NNNN | DATA |
         * RRRR - regAddr, NNNN - number of registers to write to */
        opcode[0] = BSP_ECG_ADS1192_SPI_WRITE_OP | regAddr;
        opcode[1] = BSP_ECG_ADS1192_SPI_SINGLE_REG;
        opcode[2] = *inData;

        // leave RX buffer empty, function allows it
        ret_code = nrf_drv_spi_transfer(&spi0Instance, &(opcode[0]), txBufferLen, NULL, rxBufferLen);

        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function for reading from one or multiple registers of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inReg        - starting register address.
 * @param [out] *outData     - pointer to data to be read.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    21.10.2020
 ******************************************************************************/
static uint8_t BSP_ECG_ADS1192_readSingleReg(BSP_ECG_ADS1192_device_S *inDevice,
                                             const BSP_ECG_ADS1192_reg_E inReg,
                                             uint8_t *outData,
                                             BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t retVal = 0xFFu;
    uint32_t ret_code;
    uint8_t opcode[BSP_ECG_ADS1192_SPI_OPCODE_SIZE_R] = { 0u };
    uint8_t regAddr = ecgADS1192RegAddr[inReg];

    if((inDevice != NULL) && (outData != NULL)) {
        /* byte format for Read opcode: | 001R RRRR | 000N NNNN |
         * RRRR - regAddr, NNNN - number of registers to read */
        opcode[0] = BSP_ECG_ADS1192_SPI_READ_OP | regAddr;
        opcode[1] = BSP_ECG_ADS1192_SPI_SINGLE_REG;

        // start SPI transfer
        ret_code = nrf_drv_spi_transfer(&spi0Instance,
                       &(opcode[0]),
                       BSP_ECG_ADS1192_SPI_OPCODE_SIZE_R,
                       &(outData[0]),
                       BSP_ECG_ADS1192_SPI_OPCODE_SIZE_R + BSP_ECG_ADS1192_SPI_READ_OFFSET);

        // TODO: [mario.kodba 1.12.2020.] check this delay and value, seems to work correctly with it
        nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        } else {
            retVal = outData[BSP_ECG_ADS1192_SPI_REG_VALUE_INDEX];
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }

    return retVal;

}

/*******************************************************************************
 * @brief Function for reading data shifted out of ADS1192.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [in]  inSize       - length (in bytes) of data to be read.
 * @param [out] *outData     - pointer to data to be read.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    01.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readData(BSP_ECG_ADS1192_device_S *inDevice,
                                    const uint8_t inSize,
                                    uint8_t *outData,
                                    BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    if((inDevice != NULL) && (outData != NULL)) {
        uint32_t ret_code;
        // start SPI transfer
        ret_code = nrf_drv_spi_transfer(&spi0Instance,
                                        NULL,
                                        0u,
                                        outData,
                                        inSize);
        if(ret_code != NRF_SUCCESS) {
            ecgErr = BSP_ECG_ADS1192_err_SPI_READ_WRITE;
        }
    } else {
        ecgErr = BSP_ECG_ADS1192_err_NULL_PARAM;
    }

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function activates reset impulse needed on device initialization.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    08.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_initReset(BSP_ECG_ADS1192_device_S *inDevice,
                                      BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

