mKoDba/nrf51_muha/application/bsp/bsp_ecg_ADS1192.c
    // set nRESET pin high
    nrf_gpio_pin_set(ECG_RST);
    // wait 1s, according to datasheet power-up sequence
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

    /* hold nRESET low for 1 period of fMOD frequency,
     * according to datasheet, fMOD = 128kHz -> tMOD = 8us*/
    nrf_gpio_pin_clear(ECG_RST);
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_1_FMOD);

    // set nRESET pin high again
    nrf_gpio_pin_set(ECG_RST);

    // wait 18 * tCLK, with fCLK = 512kHz -> tCLK = 2us
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_18_TCLK);

    // reset device registers to default values
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RESET, &ecgErr);
    // wait 9 * fMOD cycles for RESET command to finish executing
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_9_FMOD);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Sets device MUX to read temperature from device sensor.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_updateTemperature(BSP_ECG_ADS1192_device_S *inDevice,
                                              BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t outBuffer[6] = { 0u };

    // set channel 2 for temp measurement
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_chXsetReg_U chReg = { .R = 0u };
        // set PGA to 1x
        chReg.B.pga = 1u;
        chReg.B.mux = 4u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_CH2_SET,
                                 (uint8_t *) &chReg,
                                 &ecgErr);
    }

    // enable calibrating PGA
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        uint8_t calib = 0x80u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_MISC_2,
                                 (uint8_t *) &calib,
                                 &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);

    // start reading data
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);

    // read data shifted out from device
    // 16 status bits + 2 channels x 16 bits
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_readData(inDevice, 6, &outBuffer[0], &ecgErr);
    }
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_4_TCLK);

    int16_t readVal = outBuffer[4] << BSP_ECG_ADS1192_TEMP_BIT_MASK;
    readVal = readVal | outBuffer[5];
    // set device temperature
    inDevice->temperature = (((readVal - BSP_ECG_ADS1192_TEMP_CONST_1) / BSP_ECG_ADS1192_TEMP_CONST_2)
            + BSP_ECG_ADS1192_TEMP_CONST_3);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function reads test signal.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    13.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_readTestSignal(BSP_ECG_ADS1192_device_S *inDevice,
                                           BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;
    uint8_t outBuffer[6] = { 0 };

    BSP_ECG_ADS1192_config2Reg_U conf2Reg = { .R = 0u };
    conf2Reg.R = 0xA3u;
    BSP_ECG_ADS1192_writeSingleReg(inDevice,
                             BSP_ECG_ADS1192_reg_CONFIG_2,
                             (uint8_t *) &conf2Reg,
                             &ecgErr);

//    uint8_t chRegs[2] = { 0x05u, 0x05u };
//    // set both channels to test signal
//    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//        BSP_ECG_ADS1192_writeSingleReg(inDevice,
//                                 BSP_ECG_ADS1192_reg_CH1_SET,
//                                 2u,
//                                 &chRegs[0],
//                                 2u,
//                                 &ecgErr);
//    }

    // enable calibrating PGA
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        uint8_t calib = 0x80u;
        BSP_ECG_ADS1192_writeSingleReg(inDevice,
                                 BSP_ECG_ADS1192_reg_MISC_2,
                                 (uint8_t *) &calib,
                                 &ecgErr);
    }

    // calibrate PGA
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_OFFSETCAL, &ecgErr);

    // issue read command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);

    // read data shifted out from device
    // 16 status bits + 2 channels x 16 bits
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_readData(inDevice, 6, &outBuffer[0], &ecgErr);
        for(uint8_t i = 0u; i<6; i++) {
            SEGGER_RTT_printf(0, "%x\n", outBuffer[i]);
        }
    }

    // issue read command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_SDATAC, &ecgErr);
    // wait 4 * tCLK after sending SDATAC command
    nrf_delay_us(BSP_ECG_ADS1192_WAIT_TIME_8_US);

    if(outErr != NULL) {
        *outErr = ecgErr;
    }
}

/*******************************************************************************
 * @brief Function for detecting if Right-Leg Drive off - not connected.
 ******************************************************************************
 * @param [in]  *inDevice    - device structure for ECG driver.
 * @param [out] *outErr      - error parameter.
 ******************************************************************************
 * @author  mario.kodba
 * @date    29.11.2020
 ******************************************************************************/
static void BSP_ECG_ADS1192_detectRldOff(BSP_ECG_ADS1192_device_S *inDevice,
                                         BSP_ECG_ADS1192_err_E *outErr) {

    BSP_ECG_ADS1192_err_E ecgErr = BSP_ECG_ADS1192_err_NONE;

    // set Lead-off comparator threshold
    uint8_t loffVal = 0x11u;
    BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF, &loffVal, &ecgErr);

    // configure Configuration 2 register for lead-off detection
    uint8_t conf2Val = 0xE0u;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_CONFIG_2, &conf2Val, &ecgErr);
    }
    // wait for reference voltage to settle
    nrf_delay_us(BSP_ECG_ADS1192_INIT_WAIT_TIME_200_MS);

//    // set channels to normal input (electrode)
//    uint8_t chVal = 0x00u;
//    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_CH1_SET, 2u, &chVal, 2u, &ecgErr);
//    }
//
//    // configure RLD_SENS register
//    uint8_t rldSensVal = 0x30u;
//    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
//        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_RLD_SENS, 1u, &rldSensVal, 1u, &ecgErr);
//    }

    // configure LOFF_SENS register
    uint8_t loffSensVal = 0x0Fu;
    if(ecgErr == BSP_ECG_ADS1192_err_NONE) {
        BSP_ECG_ADS1192_writeSingleReg(inDevice, BSP_ECG_ADS1192_reg_LOFF_SENS, &loffSensVal, &ecgErr);
    }

    // issue read command
    BSP_ECG_ADS1192_sendSpiCommand(inDevice, BSP_ECG_ADS1192_SPI_RDATA, &ecgErr);

